// № 1       Відповідь:
// if (!(num1 >= 0 || num2 <= 10)) {
//   alert('неверно');
// } else {
//   alert('верно');
// }

// № 11       Відповідь:
// let test = true;
// if (test) {
//   alert('верно');
// } else {
//   alert('неверно');
// }

// № 12       Відповідь:
// let test = true;
// if (!test) {
//   alert('верно');
// } else {
//   alert('неверно');
// }

// № 13       Відповідь:
// let test = true;
// if (!test) {
//   alert('верно');
// } else {
//   alert('неверно');
// }

// № 14       Відповідь:
// let test = true;
// if (test) {
//   alert('верно');
// } else {
//   alert('неверно');
// }

// № 25       Відповідь:
// let test = 10;
// if (test === 10) {
//   alert('верно');
// }

// № 26       Відповідь:
// if (test == 0) alert('верно'); else alert('неверно!');

// № 27       Відповідь:
// if (test == 0) alert('верно')

// № 28       Відповідь:
// let day = 15; // Замените на нужное число
// if (day >= 1 && day <= 10) {
//   alert('Первая декада месяца');
// }
// if (day > 10 && day <= 20) {
//   alert('Вторая декада месяца');
// }
// if (day > 20 && day <= 31) {
//   alert('Третья декада месяца');
// }
// if (day < 1 || day > 31) {
//   alert('Недопустимое значение дня');
// }

// № 29       Відповідь:
// let day = 15; // Замените на нужное число
// if (day >= 1 && day <= 10) {
//   alert('Первая декада месяца');
// } else if (day > 10 && day <= 20) {
//   alert('Вторая декада месяца');
// } else if (day > 20 && day <= 31) {
//   alert('Третья декада месяца');
// } else {
//   alert('Недопустимое значение дня');
// }

// № 30       Відповідь:
// let day = 15; // Замените на нужное число
// if (typeof day === 'number' && day >= 1 && day <= 31) {
//   if (day >= 1 && day <= 10) {
//     alert('Первая декада месяца');
//   } else if (day > 10 && day <= 20) {
//     alert('Вторая декада месяца');
//   } else {
//     alert('Третья декада месяца');
//   }
// } else {
//   alert('Ошибка: Недопустимое значение дня');
// }

// № 31       Відповідь:
// let age = 57; // Замените на нужное число
// if (age < 10 || age > 99) {
//   alert('Число не входит в диапазон от 10 до 99');
// } else {
//   let digitSum = Math.floor(age / 10) + (age % 10);
//   if (digitSum <= 9) {
//     alert('Сумма цифр однозначна');
//   } else {
//     alert('Сумма цифр двузначна');
//   }
// }

